In [1]:
import pandas as pd
import numpy as np

In [2]:
dfMale = pd.read_csv("Indian-Male-Names.csv")
dfFemale = pd.read_csv("Indian-Female-Names.csv")

In [3]:
dfMale.head()

              name gender    race
0          barjraj      m  indian
1     ramdin verma      m  indian
2  sharat chandran      m  indian
3  birender mandal      m  indian
4             amit      m  indian

In [4]:
dfFemale.head()

              name gender    race
0          shivani      f  indian
1             isha      f  indian
2  smt shyani devi      f  indian
3            divya      f  indian
4            mansi      f  indian

In [5]:
unisexList= []

In [6]:
for x in dfMale["name"]:
    for y in dfFemale["name"]:
        if x == y: unisexList.append(y)

In [7]:
dict = {'name': unisexList, 'gender': 'u'}
dfUnisex = pd.DataFrame(dict)

In [8]:
dfUnisex

              name gender
0           sanjay      u
1             aman      u
2             aman      u
3          durgesh      u
4          durgesh      u
...            ...    ...
12513  vinod kumar      u
12514    raj kumar      u
12515         monu      u
12516       deepak      u
12517       deepak      u

[12518 rows x 2 columns]

In [9]:
dfUnisex = dfUnisex.drop_duplicates(subset='name', keep='first', inplace=False)

In [10]:
dfFinal = dfMale.append([dfFemale, dfUnisex], ignore_index=True)
del dfFinal['race']

In [11]:
dfFinal

                  name gender
0              barjraj      m
1         ramdin verma      m
2      sharat chandran      m
3      birender mandal      m
4                 amit      m
...                ...    ...
30480          tasleem      u
30481           lovely      u
30482           kalpna      u
30483           ruksar      u
30484            pinki      u

[30485 rows x 2 columns]

In [13]:
dfFinal.isnull().isnull().sum()

name      0
gender    0
dtype: int64

In [15]:
dfFinal[dfFinal.gender == 'f'].size

30764

In [16]:
dfFinal[dfFinal.gender == 'm'].size

29690

In [17]:
dfFinal[dfFinal.gender == 'u'].size

516

In [18]:
dfFinal.to_csv(r'Merged-Formatted-Indian-Names.csv', index=False)